#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-DSR-USER.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_SIT/DSR_USER"]: Refreshing state... [id=moh_applications/client/bf1a894f-9665-42b7-96e5-c9ee90bef5fb/scope-mappings/1197df69-9199-49a5-a49a-c7d43d35551c/c31af1e0-f13b-4505-8b55-c437fdacffb5]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-DSR-USER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_SIT/DSR_USER"]: Refreshing state... [id=d106947f-49e5-4b46-aa82-ee64ad314736/c31af1e0-f13b-4505-8b55-c437fdacffb5]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-DSR-USER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_UAT/DSR_USER"]: Refreshing state... [id=d106947f-49e5-4b46-aa82-ee64ad314736/fcb22564-e254-4bb2-8ebf-4596a1ab1330]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-DSR-USER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_IAT/DSR_USER"]: Refreshing state... [id=d106947f-49e5-4b46-aa82-ee64ad314736/08f14258-e522-4116-ae91-9cdda9ada3e9]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-DSR-USER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_REV/DSR_USER"]: Refreshing state... [id=d106947f-49e5-4b46-aa82-ee64ad314736/41a5dd49-9708-482b-b789-d79f46e573a0]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-DSR-USER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_CONF/DSR_USER"]: Refreshing state... [id=d106947f-49e5-4b46-aa82-ee64ad314736/6c3b9d2b-e51e-4e47-a698-3597ca4e19a2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_TEST.module.moh_applications.module.DHT-DEV.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "DHT-DEV"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Digital Health Toolkit Dev Environment. The client is part of LRA integration."
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "DHT-DEV"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "http://localhost:*",
          + "https://dev-smilecdr.htk.healthcarebc.ca/smart_auth",
          + "https://localhost:*",
        ]
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.DHT-DEV.keycloak_openid_user_client_role_protocol_mapper.Client-Role-Mapper-LICENCE-STATUS will be created
  + resource "keycloak_openid_user_client_role_protocol_mapper" "Client-Role-Mapper-LICENCE-STATUS" {
      + add_to_access_token         = true
      + add_to_id_token             = true
      + add_to_userinfo             = true
      + claim_name                  = "roles"
      + claim_value_type            = "String"
      + client_id                   = (known after apply)
      + client_id_for_role_mappings = "LICENCE-STATUS"
      + id                          = (known after apply)
      + multivalued                 = true
      + name                        = "Client Role Mapper for LICENCE-STATUS"
      + realm_id                    = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.DHT-DEV.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["LICENCE-STATUS/MD"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "652893c3-8e83-400e-9f6b-937e354f305c"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.DHT-DEV.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["LICENCE-STATUS/MOA"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "6167c7e5-aa86-4e6f-ba05-ecb9bb2aa7e8"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.DHT-DEV.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["LICENCE-STATUS/PRACTITIONER"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "d6669b04-2962-4bb3-ad33-5b92a3d784df"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.DHT-DEV.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["LICENCE-STATUS/RNP"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "5e704cdc-3460-4f01-9707-9e919c8dc28c"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*